/*************************************************************************
	> File Name: ol2_3.c
	> Author: 
	> Mail: 
	> Created Time: 2018年04月26日 星期四 00时56分46秒
 ************************************************************************/

#include <stdio.h>  
  
  int main()  
  {  
      const int MAX = 4000000;  
      int f0 = 0, f1 = 1, f2;  
      int sum = 0;  
      while (f0 < MAX)  
      {  
              sum += f0;  
        
              f2 = f0 + f1;  
              f0 = f2 + f1;  
              f1 = f0 + f2;  
          }  
    
      printf("斐波那契数列中数值不超过%d的项，这些项中值为偶数的项之和%d\n", MAX, sum);  
      return 0;  }
